<a href="https://colab.research.google.com/github/nike-2001/pandas/blob/main/Copy_of_Pandas_Modifying_DataFrames_and_Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

# Downloading and Loading Datasets
Downloading all the required csv files and loading the data into the dataframes

In [ ]:
# eCommerce Dataset
!wget https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/shopping_data_v2.csv

shopping_df = pd.read_csv('shopping_data_v2.csv')

--2021-01-25 12:12:15--  https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/shopping_data_v2.csv
Resolving nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)... 52.219.62.71
Connecting to nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)|52.219.62.71|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 16278053 (16M) [text/csv]
Saving to: ‘shopping_data_v2.csv.2’

shopping_data_v2.cs 100%[===================>]  15.52M  5.34MB/s    in 2.9s

2021-01-25 12:12:19 (5.34 MB/s) - ‘shopping_data_v2.csv.2’ saved [16278053/16278053]

In [ ]:
# Covid Dataset
!wget https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/italy-covid-daywise.csv

covid_df = pd.read_csv('italy-covid-daywise.csv')

--2021-01-25 12:12:19--  https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/italy-covid-daywise.csv
Resolving nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)... 52.219.62.38
Connecting to nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)|52.219.62.38|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 6619 (6.5K) [text/csv]
Saving to: ‘italy-covid-daywise.csv.2’

italy-covid-daywise 100%[===================>]   6.46K  --.-KB/s    in 0s

2021-01-25 12:12:20 (117 MB/s) - ‘italy-covid-daywise.csv.2’ saved [6619/6619]

In [ ]:
# Stackoverflow Survey Dataset
!wget https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/survey_results_public.csv

survey_df = pd.read_csv('survey_results_public.csv')

--2021-01-25 12:12:20--  https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/survey_results_public.csv
Resolving nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)... 52.219.62.38
Connecting to nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)|52.219.62.38|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 94603888 (90M) [text/csv]
Saving to: ‘survey_results_public.csv.2’

survey_results_publ 100%[===================>]  90.22M  12.9MB/s    in 8.6s

2021-01-25 12:12:30 (10.5 MB/s) - ‘survey_results_public.csv.2’ saved [94603888/94603888]

In [ ]:
# Film Dataset
!wget https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/film.csv

films_df = pd.read_csv('film.csv')

--2021-01-25 12:12:31--  https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/film.csv
Resolving nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)... 3.5.210.189
Connecting to nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)|3.5.210.189|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 102889 (100K) [text/csv]
Saving to: ‘film.csv.2’

film.csv.2          100%[===================>] 100.48K   217KB/s    in 0.5s

2021-01-25 12:12:32 (217 KB/s) - ‘film.csv.2’ saved [102889/102889]

# Modifying Column Names

In [ ]:
people = {
    "First Name": ["Kristen", 'Maxine', 'John'], 
    "Last Name": ["Carol", 'Willians', 'Smith'], 
    "Email ID": ["KristenC@gmail.com", 'Maxine.Williams@email.com', 'JohnSmith@email.com']
}

In [ ]:
people_df = pd.DataFrame(people)
people_df

  First Name Last Name                   Email ID
0    Kristen     Carol         KristenC@gmail.com
1     Maxine  Willians  Maxine.Williams@email.com
2       John     Smith        JohnSmith@email.com

In [ ]:
people_df.columns

Index(['First Name', 'Last Name', 'Email ID'], dtype='object')

In [ ]:
people_df.columns = ["F Name", "L Name", "Email"]
people_df

    F Name    L Name                      Email
0  Kristen     Carol         KristenC@gmail.com
1   Maxine  Willians  Maxine.Williams@email.com
2     John     Smith        JohnSmith@email.com

In [ ]:
people_df.columns = people_df.columns.str.replace(' ', '_')
people_df

    F_Name    L_Name                      Email
0  Kristen     Carol         KristenC@gmail.com
1   Maxine  Willians  Maxine.Williams@email.com
2     John     Smith        JohnSmith@email.com

In [ ]:
people_df.columns = [x.lower() for x in people_df]
people_df

    f_name    l_name                      email
0  Kristen     Carol         KristenC@gmail.com
1   Maxine  Willians  Maxine.Williams@email.com
2     John     Smith        JohnSmith@email.com

### pd.DataFrame.rename
* `pd.DataFrame.rename(mapper=None, index=None, columns=None, axis=None, inplace=False)`
  *   `mapper` is the dict-like or functions transformations to apply to that axis’ values.
  *   `axis` is the axis to target with mapper.
  *   `index` is an alternative to specifying axis (mapper, axis=0 is equivalent to index=mapper)
  *  `columns` is an alternative to specifying axis (mapper, axis=1 is equivalent to columns=mapper)

In [ ]:
shopping_df

        Order ID  ...                           Purchase Address
0         176558  ...               917 1st St, Dallas, TX 75001
1         176559  ...          682 Chestnut St, Boston, MA 02215
2         176560  ...       669 Spruce St, Los Angeles, CA 90001
3         176560  ...       669 Spruce St, Los Angeles, CA 90001
4         176561  ...          333 8th St, Los Angeles, CA 90001
...          ...  ...                                        ...
185945    176554  ...       672 12th St, San Francisco, CA 94016
185946    176555  ...         42 4th St, San Francisco, CA 94016
185947    176556  ...          871 7th St, Los Angeles, CA 90001
185948    176557  ...  83 Washington St, San Francisco, CA 94016
185949    176557  ...  83 Washington St, San Francisco, CA 94016

[185950 rows x 6 columns]

In [ ]:
shopping_df.rename(columns={'Price Each':'Price', 'Product':'Product Name'})

        Order ID  ...                           Purchase Address
0         176558  ...               917 1st St, Dallas, TX 75001
1         176559  ...          682 Chestnut St, Boston, MA 02215
2         176560  ...       669 Spruce St, Los Angeles, CA 90001
3         176560  ...       669 Spruce St, Los Angeles, CA 90001
4         176561  ...          333 8th St, Los Angeles, CA 90001
...          ...  ...                                        ...
185945    176554  ...       672 12th St, San Francisco, CA 94016
185946    176555  ...         42 4th St, San Francisco, CA 94016
185947    176556  ...          871 7th St, Los Angeles, CA 90001
185948    176557  ...  83 Washington St, San Francisco, CA 94016
185949    176557  ...  83 Washington St, San Francisco, CA 94016

[185950 rows x 6 columns]

In [ ]:
# Alternate way of renaming columns
shopping_df.rename(mapper={'Price Each':'Price', 'Product':'Product Name'}, axis=1)

        Order ID  ...                           Purchase Address
0         176558  ...               917 1st St, Dallas, TX 75001
1         176559  ...          682 Chestnut St, Boston, MA 02215
2         176560  ...       669 Spruce St, Los Angeles, CA 90001
3         176560  ...       669 Spruce St, Los Angeles, CA 90001
4         176561  ...          333 8th St, Los Angeles, CA 90001
...          ...  ...                                        ...
185945    176554  ...       672 12th St, San Francisco, CA 94016
185946    176555  ...         42 4th St, San Francisco, CA 94016
185947    176556  ...          871 7th St, Los Angeles, CA 90001
185948    176557  ...  83 Washington St, San Francisco, CA 94016
185949    176557  ...  83 Washington St, San Francisco, CA 94016

[185950 rows x 6 columns]

**After carefully checking the changes, use `inplace=True` to make the changes reflect in the actual dataframe.**

In [ ]:
shopping_df.rename(columns={'Price Each':'Price', 'Product':'Product Name'}, inplace=True)

In [ ]:
shopping_df

        Order ID  ...                           Purchase Address
0         176558  ...               917 1st St, Dallas, TX 75001
1         176559  ...          682 Chestnut St, Boston, MA 02215
2         176560  ...       669 Spruce St, Los Angeles, CA 90001
3         176560  ...       669 Spruce St, Los Angeles, CA 90001
4         176561  ...          333 8th St, Los Angeles, CA 90001
...          ...  ...                                        ...
185945    176554  ...       672 12th St, San Francisco, CA 94016
185946    176555  ...         42 4th St, San Francisco, CA 94016
185947    176556  ...          871 7th St, Los Angeles, CA 90001
185948    176557  ...  83 Washington St, San Francisco, CA 94016
185949    176557  ...  83 Washington St, San Francisco, CA 94016

[185950 rows x 6 columns]

# Modifying Rows

Trying to update a value as shown below will raise an error. Instead, **values should be updated using `loc` or `iloc`.**

In [ ]:
filt = (people_df['email'] == 'KristenC@gmail.com')
people_df[filt]['last_name'] = 'Smith'

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
people_df

    f_name    l_name                      email
0  Kristen     Carol         KristenC@gmail.com
1   Maxine  Willians  Maxine.Williams@email.com
2     John     Smith        JohnSmith@email.com

### Updating values with `loc`

In [ ]:
people_df.loc[1] = ['Will', 'Tatum', 'Will.T@gmail.com']
people_df

    f_name l_name                email
0  Kristen  Carol   KristenC@gmail.com
1     Will  Tatum     Will.T@gmail.com
2     John  Smith  JohnSmith@email.com

In [ ]:
people_df.loc[2, ['f_name', 'email']] = ['Johnny', 'JohnnySmith@email.com']
people_df

    f_name l_name                  email
0  Kristen  Carol     KristenC@gmail.com
1     Will  Tatum       Will.T@gmail.com
2   Johnny  Smith  JohnnySmith@email.com

In [ ]:
people_df.loc[[1, 2], ['f_name']] = 'Apple'
people_df

    f_name l_name                  email
0  Kristen  Carol     KristenC@gmail.com
1    Apple  Tatum       Will.T@gmail.com
2    Apple  Smith  JohnnySmith@email.com

# Methods to Update Data

### pd.Series.apply
* `pd.Series.apply(func, convert_dtype=True, args=(), **kwds)`
  *   Applies the function on the values in the Series.
  *   `func` is the Python function or NumPy ufunc to apply.
  *   `args` are the positional arguments passed to func after the series value.
  *  `**kwds` are the additional keyword arguments passed to func.

In [ ]:
def change_product_name(product_name):
  new_name = product_name.lower()
  new_name = new_name.replace(" ", "_")
  return new_name

In [ ]:
shopping_df["Product Name"].apply(change_product_name)

0               usb-c_charging_cable
1         bose_soundsport_headphones
2                       google_phone
3                   wired_headphones
4                   wired_headphones
                     ...
185945      lightning_charging_cable
185946              27in_fhd_monitor
185947        aaa_batteries_(4-pack)
185948                        iphone
185949      lightning_charging_cable
Name: Product Name, Length: 185950, dtype: object

**Can also use lambda functions**

In [ ]:
shopping_df["Price"].apply(lambda x: x + 5)

0          16.95
1         104.99
2         605.00
3          16.99
4          16.99
           ...
185945     19.95
185946    154.99
185947      7.99
185948    705.00
185949     19.95
Name: Price, Length: 185950, dtype: float64

In [ ]:
shopping_df["Product"].apply(len)

KeyError: ignored

Apply can be used directly with dataframes too. But, the Objects passed to the function are `Series` objects

In [ ]:
shopping_df.apply(len)

Order ID            185950
Product Name        185950
Quantity Ordered    185950
Price               185950
Order Date          185950
Purchase Address    185950
dtype: int64

### pd.DataFrame.applymap
* `pd.DataFrame.applymap(func)`
  *   Applies the function to every element of the DataFrame.
  *   `func` is the Python function to apply.

In [ ]:
people = {
    "full_name": ["Jack Smith", 'Jane Lodge', 'John Doe', 'Kristen Carol'], 
    "email": ["JackSmith@gmail.com", 'JaneLodge@email.com', 'JohnDoe@email.com', 'KristenC@email.com']
}

In [ ]:
people_df = pd.DataFrame(people)
people_df

       full_name                email
0     Jack Smith  JackSmith@gmail.com
1     Jane Lodge  JaneLodge@email.com
2       John Doe    JohnDoe@email.com
3  Kristen Carol   KristenC@email.com

In [ ]:
people_df.applymap(len)

   full_name  email
0         10     19
1         10     19
2          8     17
3         13     18

In [ ]:
people_df.applymap(str.lower)

       full_name                email
0     jack smith  jacksmith@gmail.com
1     jane lodge  janelodge@email.com
2       john doe    johndoe@email.com
3  kristen carol   kristenc@email.com

### pd.Series.map
* `pd.Series.map(arg)`
  *   It is used to map values of the Series according to input correspondence.
  *   `arg` is used for substituting each value in a Series with another value. It may be a function, a dict or a Series.

**Values in the Series that are NOT in the dictionary are converted to `NaN`.**

In [ ]:
shopping_df

        Order ID  ...                           Purchase Address
0         176558  ...               917 1st St, Dallas, TX 75001
1         176559  ...          682 Chestnut St, Boston, MA 02215
2         176560  ...       669 Spruce St, Los Angeles, CA 90001
3         176560  ...       669 Spruce St, Los Angeles, CA 90001
4         176561  ...          333 8th St, Los Angeles, CA 90001
...          ...  ...                                        ...
185945    176554  ...       672 12th St, San Francisco, CA 94016
185946    176555  ...         42 4th St, San Francisco, CA 94016
185947    176556  ...          871 7th St, Los Angeles, CA 90001
185948    176557  ...  83 Washington St, San Francisco, CA 94016
185949    176557  ...  83 Washington St, San Francisco, CA 94016

[185950 rows x 6 columns]

In [ ]:
shopping_df['Product Name'].map({'Google Phone':'Google Pixel', 'iPhone':'iPhone 6'})

0                  NaN
1                  NaN
2         Google Pixel
3                  NaN
4                  NaN
              ...
185945             NaN
185946             NaN
185947             NaN
185948        iPhone 6
185949             NaN
Name: Product Name, Length: 185950, dtype: object

### pd.Series.replace
* `pd.Series.replace(to_replace=None, value=None, inplace=False)`
  *   Applies the function on the values in the Series.
  *   `to_replace` is/are the value(s) to replace. It may be a str, list, dict, Series, int etc.
  *   The `value ` to replace any values matching `to_replace` with.

In [ ]:
shopping_df['Product Name'].replace({'Google Phone':'Google Pixel', 'iPhone':'iPhone 6'})

0               USB-C Charging Cable
1         Bose SoundSport Headphones
2                       Google Pixel
3                   Wired Headphones
4                   Wired Headphones
                     ...
185945      Lightning Charging Cable
185946              27in FHD Monitor
185947        AAA Batteries (4-pack)
185948                      iPhone 6
185949      Lightning Charging Cable
Name: Product Name, Length: 185950, dtype: object

**Replace can be used with dataframes too**

In [ ]:
shopping_df.replace(to_replace=["USB-C Charging Cable", "Lightning Charging Cable"], value ="Charging Cable")

        Order ID  ...                           Purchase Address
0         176558  ...               917 1st St, Dallas, TX 75001
1         176559  ...          682 Chestnut St, Boston, MA 02215
2         176560  ...       669 Spruce St, Los Angeles, CA 90001
3         176560  ...       669 Spruce St, Los Angeles, CA 90001
4         176561  ...          333 8th St, Los Angeles, CA 90001
...          ...  ...                                        ...
185945    176554  ...       672 12th St, San Francisco, CA 94016
185946    176555  ...         42 4th St, San Francisco, CA 94016
185947    176556  ...          871 7th St, Los Angeles, CA 90001
185948    176557  ...  83 Washington St, San Francisco, CA 94016
185949    176557  ...  83 Washington St, San Francisco, CA 94016

[185950 rows x 6 columns]

# Add/Delete Columns

**We can create a new column by assigning a value as shown below**

In [ ]:
shopping_df['Store'] = pd.Series('Amazon')
shopping_df

        Order ID  ...   Store
0         176558  ...  Amazon
1         176559  ...     NaN
2         176560  ...     NaN
3         176560  ...     NaN
4         176561  ...     NaN
...          ...  ...     ...
185945    176554  ...     NaN
185946    176555  ...     NaN
185947    176556  ...     NaN
185948    176557  ...     NaN
185949    176557  ...     NaN

[185950 rows x 7 columns]

In [ ]:
people_df['full_name'] = people_df['first'] + ' ' + people_df['last']
people_df

KeyError: ignored

### Splitting columns

In [ ]:
people = {
    "full_name": ["Jack Smith", 'Jane Lodge', 'John Doe', 'Kristen Carol'], 
    "email": ["JackSmith@gmail.com", 'JaneLodge@email.com', 'JohnDoe@email.com', 'KristenC@email.com']
}

In [ ]:
people_df = pd.DataFrame(people)
people_df

       full_name                email
0     Jack Smith  JackSmith@gmail.com
1     Jane Lodge  JaneLodge@email.com
2       John Doe    JohnDoe@email.com
3  Kristen Carol   KristenC@email.com

In [ ]:
people_df['full_name'].str.split(' ')

0       [Jack, Smith]
1       [Jane, Lodge]
2         [John, Doe]
3    [Kristen, Carol]
Name: full_name, dtype: object

In [ ]:
people_df['full_name'].str.split(' ', expand=True)

         0      1
0     Jack  Smith
1     Jane  Lodge
2     John    Doe
3  Kristen  Carol

In [ ]:
people_df[['first', 'last']] = people_df['full_name'].str.split(' ', expand=True)
people_df

       full_name                email    first   last
0     Jack Smith  JackSmith@gmail.com     Jack  Smith
1     Jane Lodge  JaneLodge@email.com     Jane  Lodge
2       John Doe    JohnDoe@email.com     John    Doe
3  Kristen Carol   KristenC@email.com  Kristen  Carol

### pd.concat
* `pd.concat(objs, axis=0, ignore_index=False, keys=None)`
  * Concatenates pandas objects along a particular axis
  *   `objs` is a sequence or mapping of Series or DataFrame objects
  *  The `axis` to concatenate along.
  * If `ignore_index` is True, then it does not use the index values along the concatenation axis. The resulting axis will be labeled 0, …, n - 1.

In [ ]:
people_df

       full_name                email    first   last
0     Jack Smith  JackSmith@gmail.com     Jack  Smith
1     Jane Lodge  JaneLodge@email.com     Jane  Lodge
2       John Doe    JohnDoe@email.com     John    Doe
3  Kristen Carol   KristenC@email.com  Kristen  Carol

In [ ]:
age_and_hobbies = {
    "age": [35, 17, 21, 45], 
    "hobbies": ["painting", 'football', 'running', 'fishing']
}
age_and_hobbies_df = pd.DataFrame(age_and_hobbies)

In [ ]:
pd.concat([people_df, age_and_hobbies_df], axis=1)

       full_name                email    first   last  age   hobbies
0     Jack Smith  JackSmith@gmail.com     Jack  Smith   35  painting
1     Jane Lodge  JaneLodge@email.com     Jane  Lodge   17  football
2       John Doe    JohnDoe@email.com     John    Doe   21   running
3  Kristen Carol   KristenC@email.com  Kristen  Carol   45   fishing

In [ ]:
pd.concat([people_df, age_and_hobbies_df], axis=1, ignore_index=True)

               0                    1        2      3   4         5
0     Jack Smith  JackSmith@gmail.com     Jack  Smith  35  painting
1     Jane Lodge  JaneLodge@email.com     Jane  Lodge  17  football
2       John Doe    JohnDoe@email.com     John    Doe  21   running
3  Kristen Carol   KristenC@email.com  Kristen  Carol  45   fishing

In [ ]:
name = np.array(['Alexis', 'Jonathan'])
gender = np.array(['Female', 'Male'])
name_series = pd.Series(name)
gender_series = pd.Series(gender)

In [ ]:
user_df = pd.concat([name_series, gender_series], axis=1)
user_df

          0       1
0    Alexis  Female
1  Jonathan    Male

**You can label the index keys you create with the names option.**

In [ ]:
user_df = pd.concat([name_series, gender_series], axis=1, keys=['name', 'gender'])
user_df

       name  gender
0    Alexis  Female
1  Jonathan    Male

### pd.DataFrame.drop
* `pd.DataFrame.drop(labels=None, axis=0, index=None, columns=None, inplace=False)`
  * `labels` is the index or column labels to drop.
  *  `axis` specifies the axis to drop the labels from. 
  * `index` is an alternative to specifying the axis (labels, axis=0 is equivalent to index=labels)
  * `columns` is an alternative to specifying the axis (labels, axis=1 is equivalent to columns=labels).

In [ ]:
shopping_df.drop(columns=['Quantity Ordered', 'Purchase Address'])

        Order ID                Product Name   Price      Order Date   Store
0         176558        USB-C Charging Cable   11.95  04/19/19 08:46  Amazon
1         176559  Bose SoundSport Headphones   99.99  04/07/19 22:30     NaN
2         176560                Google Phone  600.00  04/12/19 14:38     NaN
3         176560            Wired Headphones   11.99  04/12/19 14:38     NaN
4         176561            Wired Headphones   11.99  04/30/19 09:27     NaN
...          ...                         ...     ...             ...     ...
185945    176554    Lightning Charging Cable   14.95  03/24/19 11:14     NaN
185946    176555            27in FHD Monitor  149.99  03/22/19 20:27     NaN
185947    176556      AAA Batteries (4-pack)    2.99  03/14/19 10:29     NaN
185948    176557                      iPhone  700.00  03/30/19 12:32     NaN
185949    176557    Lightning Charging Cable   14.95  03/30/19 12:32     NaN

[185950 rows x 5 columns]

Axis 1 can be referred to as 'columns'

In [ ]:
# Alternate way of deleting columns
shopping_df.drop(labels='Order Date', axis='columns')

        Order ID  ...   Store
0         176558  ...  Amazon
1         176559  ...     NaN
2         176560  ...     NaN
3         176560  ...     NaN
4         176561  ...     NaN
...          ...  ...     ...
185945    176554  ...     NaN
185946    176555  ...     NaN
185947    176556  ...     NaN
185948    176557  ...     NaN
185949    176557  ...     NaN

[185950 rows x 6 columns]

# Try It Yourself

For the following questions, use the **Stack Overflow** dataset.

**Note:** `NaN` values in the dataset just mean that the user did not respond to that in the survey.

0.   Load the dataset into a dataframe using `read_csv`.
1.   Rename the `ConvertedComp` label to `Salary` and the `MainBranch` label to `Stream`.
2.   Update the third row to have the same values for `Age` and `CompFreq` as the ninth row.
3.   Replace  the country `Russian Federation` with `Russia` throughout the dataset.
4.   Update the country of the first respondent to USA.
5.   Convert the gender to uppercase for every row.

Incase you want to access the schema of the dataset:

In [ ]:
# Stackoverflow Schema Survey Dataset
!wget https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/survey_results_schema.csv

schema_survey_df = pd.read_csv('survey_results_schema.csv')

--2021-01-25 12:14:11--  https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/survey_results_schema.csv
Resolving nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)... 52.219.66.111
Connecting to nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)|52.219.66.111|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 8428 (8.2K) [text/csv]
Saving to: ‘survey_results_schema.csv’

survey_results_sche 100%[===================>]   8.23K  --.-KB/s    in 0s

2021-01-25 12:14:12 (82.0 MB/s) - ‘survey_results_schema.csv’ saved [8428/8428]